---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExportLineweightKey
source: html/4c95b3f9-5bb0-159c-e954-07ed63a929ce.htm
---
# ExportLineweightKey Properties

Specifies whether the .NET object represents a valid Revit entity.